package com.primisen.basics.loop;

//убедиться в праильности решения
//Вывести на экран соответствии между символами и их численными обозначениями в памяти компьютера.

public class Task6 {

    public static void main(String[] args){

        char symbol = 'g';
        int valueOfSymbolInComputerMember = symbol;


        System.out.println("Symbol: "  + symbol);
        System.out.println("Value of symbol in computer member: " + valueOfSymbolInComputerMember);
    }
}